<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>lan.sciurus.munki.Fusion-Inventory-Agent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FusionInventory-Agent</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Tools/Inventory</string>
        <key>MUNKI_CATEGORY</key>
        <string>Inventory</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string></string>
            <key>display_name</key>
            <string>FusionInventory Agent</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>Inventory</string>
            <key>developer</key>
            <string>GLPI</string>
            
            <key>postinstall_script</key>
            <string>#!/bin/bash
echo "server = https://inventory.sciurus.lan" >> /opt/fusioninventory-agent/etc/conf.d/sciurus.cfg
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>lan.sciurus.download.Fusion-Inventory-Agent</string>
    <key>Process</key>
    <array>
          <dict>
              <key>Processor</key>
              <string>MunkiImporter</string>
              <key>Arguments</key>
              <dict>
                  <key>pkg_path</key>
                  <string>%pathname%</string>
                  <key>repo_subdirectory</key>
                  <string>%MUNKI_REPO_SUBDIR%</string>
              </dict>
          </dict>
    </array>
</dict>
</plist>
